[{"id":494047392,"artist":"Terry Laughlin","artwork":"https://is2-ssl.mzstatic.com/image/thumb/Publication60/v4/b8/f5/7c/b8f57c2a-be54-ca3c-d69e-f04672be90fb/source/100x100bb.jpg","track":"Total Immersion","description":"Swim better—and enjoy every lap—with <i>Total Immersion, </i>a guide to improving your swimming from an expert with more than thirty years of experience in the water.<br /><br />Terry Laughlin, the world’s #1 authority on swimming success, has made his unique approach even easier for anyone to master. Whether you’re an accomplished swimmer or have always found swimming to be a struggle, <i>Total Immersion</i> will show you that it’s mindful fluid movement—not athletic ability—that will turn you into an efficient swimmer. This new edition of the bestselling <i>Total Immersion</i> features: <br /><br />· A thoughtfully choreographed series of skill drills—practiced in the mindful spirit of yoga—that can help anyone swim more enjoyably <br />· A holistic approach to becoming one with the water and to developing a swimming style that’s always comfortable <br />· Simple but thorough guidance on how to improve fitness and form <br />· A complementary land-and-water program for achieving a strong and supple body at any age <br /><br />Based on more than thirty years of teaching, coaching, and research, <i>Total Immersion</i> has dramatically improved the physical and mental experience of swimming for thousands of people of all ages and abilities."},{"id":422539468,"artist":"John Berger","artwork":"https://is4-ssl.mzstatic.com/image/thumb/Publication/v4/d8/42/80/d8428004-eec7-6871-7f2a-e66dbb24995c/source/100x100bb.jpg","track":"G.","description":"In this luminous novel -- winner of Britain's prestigious Booker Prize -- John Berger relates the story of \"G.,\" a young man forging an energetic sexual career in Europe during the early years of this century. With profound compassion, Berger explores the hearts and minds of both men and women, and what happens during sex, to reveal the conditions of the Don Juan's success: his essential loneliness, the quiet cumulation in each of his sexual experiences of all of those that precede it, the tenderness that infuses even the briefest of his encounters, and the way women experience their own extraordinariness through their moments with him. All of this Berger sets against the turbulent backdrop of Garibaldi and the failed revolution of Milanese workers in 1898, the Boer War, and the first flight across the Alps, making G. a brilliant novel about the search for intimacy in history's private moments."}]